; domain
(define (domain beluga)
  (:requirements :typing :equality :action-costs)
  (:types
		beluga -         location
		hangar -         location
		jig -         location
		location -         object
		num -         object
		production-line -         object
		rack -         location
		side -         object
		slot -         object
		trailer -         location
		type -         object
)
  (:constants
		bside - side
		dummy-jig - jig
		dummy-slot - slot
		dummy-type - type
		fside - side
	)


  (:predicates
		(at-side ?l - location ?s - side) ; location l? accessible from side ?s
		(clear ?j - jig ?s - side) ; there is no jig before ?j on the rack when looking from ?s
		(empty ?l - location)
		(empty-size ?j - jig ?es - num) ; size of jig ?j when it was unloaded in an hangar
		(fit ?nspace - num ?jsize - num ?fspace - num ?r - rack) ; on rack ?r: ?nspace = ?jsize + ?fspace
		(free-space ?r - rack ?n - num) ; space available on rack ?r
		(in ?j - jig ?l - location)
		(is_type ?j - jig ?jt - type)
		(next-flight-to-process ?b - beluga ?nb - beluga) ; ?nb is the next flight to be processed
		(next-to ?j - jig ?nj - jig ?s - side) ; jig ?nj is before/next to jig ?j on the rack when looking from ?s
		(next_deliver ?j - jig ?jn - jig) ; ?jn is successor of ?j in delivery order to the production line
		(next_load ?jt - type ?s - slot ?ns - slot ?b - beluga)
		(next_unload ?j - jig ?nj - jig) ; ?nj is successor ?j in unload order
		(processed-flight ?b - beluga) ; Beluga ?b is currently loaded/unloaded
		(size ?j - jig ?s - num) ; current size of jig ?j
		(to_deliver ?j - jig ?pl - production-line) ; jig ?j must be delivered to production line ?pl
		(to_load ?jt - type ?s - slot ?b - beluga) ; jig of type ?jt must be loaded into slot ?s Beluga ?b
		(to_unload ?j - jig ?b - beluga) ; jig ?j must be next unload from Beluga ?b
	)


  (:functions
		(total-cost )
	)


	(:action load-beluga
		:parameters (?j - jig ?jt - type ?njt - type ?b - beluga ?t - trailer ?s - slot ?ns - slot)
		:precondition (and
			(in ?j ?t)
			(empty ?j)
			(is_type ?j ?jt)
			(processed-flight ?b)
			(to_load ?jt ?s ?b)
			(next_load ?njt ?s ?ns ?b)
			(at-side ?t bside)
		)
		:effect (and
			(in ?j ?b)
			(not (in ?j ?t))
			(empty ?t)
			(not (to_load ?jt ?s ?b))
			(to_load ?njt ?ns ?b)
			(increase (total-cost ) 1)
		)
	)





	(:action unload-beluga
		:parameters (?j - jig ?nj - jig ?t - trailer ?b - beluga)
		:precondition (and
			(in ?j ?b)
			(empty ?t)
			(at-side ?t bside)
			(processed-flight ?b)
			(to_unload ?j ?b)
			(next_unload ?j ?nj)
		)
		:effect (and
			(not (in ?j ?b))
			(in ?j ?t)
			(not (empty ?t))
			(not (to_unload ?j ?b))
			(to_unload ?nj ?b)
			(increase (total-cost ) 1)
		)
	)





	(:action get-from-hangar
		:parameters (?j - jig ?h - hangar ?t - trailer)
		:precondition (and
			(in ?j ?h)
			(empty ?t)
			(at-side ?t fside)
		)
		:effect (and
			(not (in ?j ?h))
			(in ?j ?t)
			(not (empty ?t))
			(empty ?h)
			(increase (total-cost ) 1)
		)
	)





	(:action deliver-to-hangar
		:parameters (?j - jig ?jn - jig ?t - trailer ?h - hangar ?pl - production-line ?s - num ?es - num)
		:precondition (and
			(in ?j ?t)
			(empty ?h)
			(at-side ?t fside)
			(to_deliver ?j ?pl)
			(next_deliver ?j ?jn)
			(size ?j ?s)
			(empty-size ?j ?es)
		)
		:effect (and
			(empty ?t)
			(empty ?j)
			(in ?j ?h)
			(not (in ?j ?t))
			(not (to_deliver ?j ?pl))
			(to_deliver ?jn ?pl)
			(increase (total-cost ) 1)
			(not (size ?j ?s))
			(size ?j ?es)
		)
	)





	(:action put-down-rack
		:parameters (?j - jig ?t - trailer ?r - rack ?s - side ?jsize - num ?fspace - num ?nspace - num)
		:precondition (and
			(in ?j ?t)
			(empty ?r)
			(at-side ?t ?s)
			(at-side ?r ?s)
			(size ?j ?jsize)
			(free-space ?r ?fspace)
			(fit ?nspace ?jsize ?fspace ?r)
		)
		:effect (and
			(in ?j ?r)
			(not (in ?j ?t))
			(empty ?t)
			(not (empty ?r))
			(clear ?j bside)
			(clear ?j fside)
			(increase (total-cost ) 1)
			(not (free-space ?r ?fspace))
			(free-space ?r ?nspace)
		)
	)





	(:action stack-rack
		:parameters (?j - jig ?nj - jig ?t - trailer ?r - rack ?s - side ?os - side ?jsize - num ?fspace - num ?nspace - num)
		:precondition (and
			(not (= ?s ?os))
			(in ?j ?t)
			(in ?nj ?r)
			(at-side ?t ?s)
			(at-side ?r ?s)
			(clear ?nj ?s)
			(size ?j ?jsize)
			(free-space ?r ?fspace)
			(fit ?nspace ?jsize ?fspace ?r)
		)
		:effect (and
			(in ?j ?r)
			(not (in ?j ?t))
			(empty ?t)
			(not (clear ?nj ?s))
			(clear ?j ?s)
			(next-to ?j ?nj ?s)
			(next-to ?nj ?j ?os)
			(increase (total-cost ) 1)
			(not (free-space ?r ?fspace))
			(free-space ?r ?nspace)
		)
	)





	(:action pick-up-rack
		:parameters (?j - jig ?t - trailer ?r - rack ?s - side ?os - side ?jsize - num ?fspace - num ?nspace - num)
		:precondition (and
			(not (= ?s ?os))
			(empty ?t)
			(in ?j ?r)
			(at-side ?t ?s)
			(at-side ?r ?s)
			(clear ?j bside)
			(clear ?j fside)
			(size ?j ?jsize)
			(free-space ?r ?fspace)
			(fit ?fspace ?jsize ?nspace ?r)
		)
		:effect (and
			(in ?j ?t)
			(not (in ?j ?r))
			(empty ?r)
			(not (empty ?t))
			(not (clear ?j bside))
			(not (clear ?j fside))
			(increase (total-cost ) 1)
			(free-space ?r ?nspace)
			(not (free-space ?r ?fspace))
		)
	)





	(:action unstack-rack
		:parameters (?j - jig ?nj - jig ?t - trailer ?r - rack ?s - side ?os - side ?jsize - num ?fspace - num ?nspace - num)
		:precondition (and
			(not (= ?s ?os))
			(empty ?t)
			(in ?j ?r)
			(in ?nj ?r)
			(at-side ?t ?s)
			(at-side ?r ?s)
			(clear ?j ?s)
			(next-to ?j ?nj ?s)
			(next-to ?nj ?j ?os)
			(size ?j ?jsize)
			(free-space ?r ?fspace)
			(fit ?fspace ?jsize ?nspace ?r)
		)
		:effect (and
			(in ?j ?t)
			(not (in ?j ?r))
			(not (empty ?t))
			(not (next-to ?j ?nj ?s))
			(not (next-to ?nj ?j ?os))
			(clear ?nj ?s)
			(increase (total-cost ) 1)
			(free-space ?r ?nspace)
			(not (free-space ?r ?fspace))
		)
	)





	(:action beluga-complete
		:parameters (?b - beluga ?nb - beluga)
		:precondition (and
			(processed-flight ?b)
			(next-flight-to-process ?b ?nb)
			(to_unload dummy-jig ?b)
			(to_load dummy-type dummy-slot ?b)
		)
		:effect (and
			(not (processed-flight ?b))
			(processed-flight ?nb)
			(increase (total-cost ) 1)
		)
	)


)

; problem
(define
	(problem beluga-problem_1_s43_j5_r2_oc51_f3)
	(:domain beluga)
  (:objects
		; Numbers: {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 23, 24, 25, 28, 32}
		n00 - num
		n01 - num
		n02 - num
		n03 - num
		n04 - num
		n05 - num
		n06 - num
		n07 - num
		n08 - num
		n09 - num
		n10 - num
		n11 - num
		n12 - num
		n13 - num
		n14 - num
		n15 - num
		n16 - num
		n17 - num
		n18 - num
		n19 - num
		n20 - num
		n21 - num
		n23 - num
		n24 - num
		n25 - num
		n28 - num
		n32 - num
		; trailers:
		beluga_trailer_1 - trailer
		beluga_trailer_2 - trailer
		factory_trailer_1 - trailer
		; Racks:
		rack00 - rack
		rack01 - rack
		; Jigs:
		jig0001 - jig
		jig0002 - jig
		jig0003 - jig
		jig0004 - jig
		jig0005 - jig
		typeA - type
		typeB - type
		typeC - type
		typeD - type
		typeE - type
		; hangars:
		hangar1 - hangar
		hangar2 - hangar
		hangar3 - hangar
		; Beluga flights:
		beluga1 - beluga
		beluga2 - beluga
		beluga3 - beluga
		; Slots for outgoing flights:
		slot0 - slot
		slot1 - slot
		slot2 - slot
		; Production lines:
		pl0 - production-line
		pl1 - production-line
		pl2 - production-line
	)
  (:init
		; Number encoding
		; Sizes fitting rack: rack00
		(fit  n00  n04  n04 rack00)
		(fit  n01  n04  n05 rack00)
		(fit  n02  n04  n06 rack00)
		(fit  n03  n04  n07 rack00)
		(fit  n04  n04  n08 rack00)
		(fit  n00  n08  n08 rack00)
		(fit  n05  n04  n09 rack00)
		(fit  n01  n08  n09 rack00)
		(fit  n00  n09  n09 rack00)
		(fit  n06  n04  n10 rack00)
		(fit  n02  n08  n10 rack00)
		(fit  n01  n09  n10 rack00)
		(fit  n07  n04  n11 rack00)
		(fit  n03  n08  n11 rack00)
		(fit  n02  n09  n11 rack00)
		(fit  n00  n11  n11 rack00)
		(fit  n08  n04  n12 rack00)
		(fit  n04  n08  n12 rack00)
		(fit  n03  n09  n12 rack00)
		(fit  n01  n11  n12 rack00)
		(fit  n09  n04  n13 rack00)
		(fit  n05  n08  n13 rack00)
		(fit  n04  n09  n13 rack00)
		(fit  n02  n11  n13 rack00)
		(fit  n10  n04  n14 rack00)
		(fit  n06  n08  n14 rack00)
		(fit  n05  n09  n14 rack00)
		(fit  n03  n11  n14 rack00)
		(fit  n11  n04  n15 rack00)
		(fit  n07  n08  n15 rack00)
		(fit  n06  n09  n15 rack00)
		(fit  n04  n11  n15 rack00)
		(fit  n12  n04  n16 rack00)
		(fit  n08  n08  n16 rack00)
		(fit  n07  n09  n16 rack00)
		(fit  n05  n11  n16 rack00)
		(fit  n13  n04  n17 rack00)
		(fit  n09  n08  n17 rack00)
		(fit  n08  n09  n17 rack00)
		(fit  n06  n11  n17 rack00)
		(fit  n15  n04  n19 rack00)
		(fit  n11  n08  n19 rack00)
		(fit  n10  n09  n19 rack00)
		(fit  n08  n11  n19 rack00)
		(fit  n01  n18  n19 rack00)
		(fit  n16  n04  n20 rack00)
		(fit  n12  n08  n20 rack00)
		(fit  n11  n09  n20 rack00)
		(fit  n09  n11  n20 rack00)
		(fit  n02  n18  n20 rack00)
		(fit  n17  n04  n21 rack00)
		(fit  n13  n08  n21 rack00)
		(fit  n12  n09  n21 rack00)
		(fit  n10  n11  n21 rack00)
		(fit  n03  n18  n21 rack00)
		(fit  n19  n04  n23 rack00)
		(fit  n15  n08  n23 rack00)
		(fit  n14  n09  n23 rack00)
		(fit  n12  n11  n23 rack00)
		(fit  n05  n18  n23 rack00)
		(fit  n20  n04  n24 rack00)
		(fit  n16  n08  n24 rack00)
		(fit  n15  n09  n24 rack00)
		(fit  n13  n11  n24 rack00)
		(fit  n06  n18  n24 rack00)
		(fit  n24  n04  n28 rack00)
		(fit  n20  n08  n28 rack00)
		(fit  n19  n09  n28 rack00)
		(fit  n17  n11  n28 rack00)
		(fit  n10  n18  n28 rack00)
		(fit  n03  n25  n28 rack00)
		(fit  n00  n32  n32 rack00)
		(fit  n28  n04  n32 rack00)
		(fit  n24  n08  n32 rack00)
		(fit  n23  n09  n32 rack00)
		(fit  n21  n11  n32 rack00)
		(fit  n14  n18  n32 rack00)
		(fit  n07  n25  n32 rack00)
		; Sizes fitting rack: rack01
		(fit  n00  n04  n04 rack01)
		(fit  n01  n04  n05 rack01)
		(fit  n02  n04  n06 rack01)
		(fit  n03  n04  n07 rack01)
		(fit  n04  n04  n08 rack01)
		(fit  n00  n08  n08 rack01)
		(fit  n05  n04  n09 rack01)
		(fit  n01  n08  n09 rack01)
		(fit  n00  n09  n09 rack01)
		(fit  n07  n04  n11 rack01)
		(fit  n03  n08  n11 rack01)
		(fit  n02  n09  n11 rack01)
		(fit  n00  n11  n11 rack01)
		(fit  n08  n04  n12 rack01)
		(fit  n04  n08  n12 rack01)
		(fit  n03  n09  n12 rack01)
		(fit  n01  n11  n12 rack01)
		(fit  n09  n04  n13 rack01)
		(fit  n05  n08  n13 rack01)
		(fit  n04  n09  n13 rack01)
		(fit  n02  n11  n13 rack01)
		(fit  n11  n04  n15 rack01)
		(fit  n07  n08  n15 rack01)
		(fit  n06  n09  n15 rack01)
		(fit  n04  n11  n15 rack01)
		(fit  n12  n04  n16 rack01)
		(fit  n08  n08  n16 rack01)
		(fit  n07  n09  n16 rack01)
		(fit  n05  n11  n16 rack01)
		(fit  n16  n04  n20 rack01)
		(fit  n12  n08  n20 rack01)
		(fit  n11  n09  n20 rack01)
		(fit  n09  n11  n20 rack01)
		(fit  n02  n18  n20 rack01)
		(fit  n20  n04  n24 rack01)
		(fit  n16  n08  n24 rack01)
		(fit  n15  n09  n24 rack01)
		(fit  n13  n11  n24 rack01)
		(fit  n06  n18  n24 rack01)
		; trailers (Beluga side):
		(empty beluga_trailer_1)
		(at-side beluga_trailer_1 bside)
		(empty beluga_trailer_2)
		(at-side beluga_trailer_2 bside)
		; trailers (Factory side):
		(empty factory_trailer_1)
		(at-side factory_trailer_1 fside)
		; Racks 2
		; Rack:rack00
		(at-side rack00 bside)
		(at-side rack00 fside)
		(free-space rack00 n14)
		(in jig0001 rack00)
		(clear jig0001 bside)
		(clear jig0001 fside)
		; Rack:rack01
		(at-side rack01 bside)
		(at-side rack01 fside)
		(free-space rack01 n13)
		(in jig0002 rack01)
		(clear jig0002 bside)
		(clear jig0002 fside)
		; Jigs (size):
		(is_type jig0001 typeD)
		(size jig0001 n18)
		(empty-size jig0001 n18)
		(empty jig0001)
		(is_type jig0002 typeB)
		(size jig0002 n11)
		(empty-size jig0002 n08)
		(is_type jig0003 typeB)
		(size jig0003 n11)
		(empty-size jig0003 n08)
		(is_type jig0004 typeB)
		(size jig0004 n11)
		(empty-size jig0004 n08)
		(is_type jig0005 typeB)
		(size jig0005 n11)
		(empty-size jig0005 n08)
		; hangars:
		(empty hangar1)
		(empty hangar2)
		(empty hangar3)
		; Flight schedule initial phase:
		(processed-flight beluga1)
		; Flight order:
		(next-flight-to-process beluga1 beluga2)
		(next-flight-to-process beluga2 beluga3)
		; Number of flights: 3
		; Incoming jigs unload order:
		; Finished Flights
		; No already completely finished Flights
		; Current Flight: beluga1
		; 0: jig0003 1: jig0004
		(to_unload jig0003 beluga1)
		(in jig0003 beluga1)
		(next_unload jig0003 jig0004)
		(in jig0004 beluga1)
		(next_unload jig0004 dummy-jig)
		; To Process Flights
		; Flight: beluga2
		; 0: jig0005
		(to_unload jig0005 beluga2)
		(in jig0005 beluga2)
		(next_unload jig0005 dummy-jig)
		; Flight: beluga3
		; No jigs
		(to_unload dummy-jig beluga3)
		; Outgoing jigs load order:
		; Finished Flights
		; No already completely finished Flights
		; Current Flight: beluga1
		; (0: typeD)
		(to_load typeD slot0 beluga1)
		(next_load dummy-type slot0 dummy-slot beluga1)
		; To Process Flights
		; No jigs
		(to_load dummy-type dummy-slot beluga2)
		; 0: typeB 1: typeB 2: typeB
		(to_load typeB slot0 beluga3)
		(next_load typeB slot0 slot1 beluga3)
		(next_load typeB slot1 slot2 beluga3)
		(next_load dummy-type slot2 dummy-slot beluga3)
		; Production schedule:
		; Production line: pl0
		; 0: jig0002
		(to_deliver jig0002 pl0)
		(next_deliver jig0002 dummy-jig)
		; Production line: pl1
		; 0: jig0003 1: jig0005
		(to_deliver jig0003 pl1)
		(next_deliver jig0003 jig0005)
		(next_deliver jig0005 dummy-jig)
		; Production line: pl2
		; 0: jig0004
		(to_deliver jig0004 pl2)
		(next_deliver jig0004 dummy-jig)
		; Action cost:
		(= (total-cost ) 0)
	)
  (:goal (and
		; All jigs empty (order defined by production schedule)
		(empty jig0002)
		(empty jig0003)
		(empty jig0005)
		(empty jig0004)
		; all Belugas fully unloaded:
		(to_unload dummy-jig beluga1)
		(to_unload dummy-jig beluga2)
		(to_unload dummy-jig beluga3)
		; all Belugas fully loaded:
		(to_load dummy-type dummy-slot beluga1)
		(to_load dummy-type dummy-slot beluga2)
		(to_load dummy-type dummy-slot beluga3)
	))
  (:metric minimize (total-cost))
)

; plan
1. (pick-up-rack jig0001 beluga_trailer_1 rack00 bside fside n18 n14 n32)
   deleted: (in jig0001 rack00) (empty beluga_trailer_1) (clear jig0001 bside) (clear jig0001 fside) (free-space rack00 n14)
   added: (in jig0001 beluga_trailer_1) (empty rack00) (free-space rack00 n32)
   goals met: 2 of 10
2. (unload-beluga jig0003 jig0004 beluga_trailer_2 beluga1)
   deleted: (in jig0003 beluga1) (empty beluga_trailer_2) (to_unload jig0003 beluga1)
   added: (in jig0003 beluga_trailer_2) (to_unload jig0004 beluga1)
   goals met: 2 of 10
3. (put-down-rack jig0003 beluga_trailer_2 rack00 bside n11 n32 n21)
   deleted: (in jig0003 beluga_trailer_2) (empty rack00) (free-space rack00 n32)
   added: (in jig0003 rack00) (empty beluga_trailer_2) (clear jig0003 bside) (clear jig0003 fside) (free-space rack00 n21)
   goals met: 2 of 10
4. (load-beluga jig0001 typed dummy-type beluga1 beluga_trailer_1 slot0 dummy-slot)
   deleted: (in jig0001 beluga_trailer_1) (to_load typed slot0 beluga1)
   added: (in jig0001 beluga1) (empty beluga_trailer_1) (to_load dummy-type dummy-slot beluga1)
   goals met: 3 of 10
5. (unload-beluga jig0004 dummy-jig beluga_trailer_1 beluga1)
   deleted: (in jig0004 beluga1) (empty beluga_trailer_1) (to_unload jig0004 beluga1)
   added: (in jig0004 beluga_trailer_1) (to_unload dummy-jig beluga1)
   goals met: 4 of 10
6. (pick-up-rack jig0003 factory_trailer_1 rack00 fside bside n11 n21 n32)
   deleted: (in jig0003 rack00) (empty factory_trailer_1) (clear jig0003 bside) (clear jig0003 fside) (free-space rack00 n21)
   added: (in jig0003 factory_trailer_1) (empty rack00) (free-space rack00 n32)
   goals met: 4 of 10
7. (deliver-to-hangar jig0003 jig0005 factory_trailer_1 hangar1 pl1 n11 n08)
   deleted: (in jig0003 factory_trailer_1) (to_deliver jig0003 pl1) (size jig0003 n11)
   added: (empty factory_trailer_1) (empty jig0003) (in jig0003 hangar1) (to_deliver jig0005 pl1) (size jig0003 n08)
   goals met: 5 of 10
8. (get-from-hangar jig0003 hangar1 factory_trailer_1)
   deleted: (in jig0003 hangar1) (empty factory_trailer_1)
   added: (in jig0003 factory_trailer_1)
   goals met: 5 of 10
9. (beluga-complete beluga1 beluga2)
   deleted: (processed-flight beluga1)
   added: (processed-flight beluga2)
   goals met: 5 of 10
10. (put-down-rack jig0003 factory_trailer_1 rack00 fside n08 n32 n24)
   deleted: (in jig0003 factory_trailer_1) (empty rack00) (free-space rack00 n32)
   added: (in jig0003 rack00) (empty factory_trailer_1) (clear jig0003 bside) (clear jig0003 fside) (free-space rack00 n24)
   goals met: 5 of 10
11. (unload-beluga jig0005 dummy-jig beluga_trailer_2 beluga2)
   deleted: (in jig0005 beluga2) (empty beluga_trailer_2) (to_unload jig0005 beluga2)
   added: (in jig0005 beluga_trailer_2) (to_unload dummy-jig beluga2)
   goals met: 6 of 10
12. (pick-up-rack jig0002 factory_trailer_1 rack01 fside bside n11 n13 n24)
   deleted: (in jig0002 rack01) (empty factory_trailer_1) (clear jig0002 bside) (clear jig0002 fside) (free-space rack01 n13)
   added: (in jig0002 factory_trailer_1) (empty rack01) (free-space rack01 n24)
   goals met: 6 of 10
13. (put-down-rack jig0004 beluga_trailer_1 rack01 bside n11 n24 n13)
   deleted: (in jig0004 beluga_trailer_1) (empty rack01) (free-space rack01 n24)
   added: (in jig0004 rack01) (empty beluga_trailer_1) (clear jig0004 bside) (clear jig0004 fside) (free-space rack01 n13)
   goals met: 6 of 10
14. (deliver-to-hangar jig0002 dummy-jig factory_trailer_1 hangar1 pl0 n11 n08)
   deleted: (in jig0002 factory_trailer_1) (to_deliver jig0002 pl0) (size jig0002 n11)
   added: (empty factory_trailer_1) (empty jig0002) (in jig0002 hangar1) (to_deliver dummy-jig pl0) (size jig0002 n08)
   goals met: 7 of 10
15. (get-from-hangar jig0002 hangar1 factory_trailer_1)
   deleted: (in jig0002 hangar1) (empty factory_trailer_1)
   added: (in jig0002 factory_trailer_1)
   goals met: 7 of 10
16. (stack-rack jig0002 jig0003 factory_trailer_1 rack00 fside bside n08 n24 n16)
   deleted: (in jig0002 factory_trailer_1) (clear jig0003 fside) (free-space rack00 n24)
   added: (in jig0002 rack00) (empty factory_trailer_1) (clear jig0002 fside) (next-to jig0002 jig0003 fside) (next-to jig0003 jig0002 bside) (free-space rack00 n16)
   goals met: 7 of 10
17. (pick-up-rack jig0004 factory_trailer_1 rack01 fside bside n11 n13 n24)
   deleted: (in jig0004 rack01) (empty factory_trailer_1) (clear jig0004 bside) (clear jig0004 fside) (free-space rack01 n13)
   added: (in jig0004 factory_trailer_1) (empty rack01) (free-space rack01 n24)
   goals met: 7 of 10
18. (deliver-to-hangar jig0004 dummy-jig factory_trailer_1 hangar1 pl2 n11 n08)
   deleted: (in jig0004 factory_trailer_1) (to_deliver jig0004 pl2) (size jig0004 n11)
   added: (empty factory_trailer_1) (empty jig0004) (in jig0004 hangar1) (to_deliver dummy-jig pl2) (size jig0004 n08)
   goals met: 8 of 10
19. (get-from-hangar jig0004 hangar1 factory_trailer_1)
   deleted: (in jig0004 hangar1) (empty factory_trailer_1)
   added: (in jig0004 factory_trailer_1)
   goals met: 8 of 10
20. (unstack-rack jig0003 jig0002 beluga_trailer_1 rack00 bside fside n08 n16 n24)
   deleted: (in jig0003 rack00) (empty beluga_trailer_1) (next-to jig0003 jig0002 bside) (next-to jig0002 jig0003 fside) (free-space rack00 n16)
   added: (in jig0003 beluga_trailer_1) (clear jig0002 bside) (free-space rack00 n24)
   goals met: 8 of 10
21. (put-down-rack jig0005 beluga_trailer_2 rack01 bside n11 n24 n13)
   deleted: (in jig0005 beluga_trailer_2) (empty rack01) (free-space rack01 n24)
   added: (in jig0005 rack01) (empty beluga_trailer_2) (clear jig0005 bside) (clear jig0005 fside) (free-space rack01 n13)
   goals met: 8 of 10
22. (beluga-complete beluga2 beluga3)
   deleted: (processed-flight beluga2)
   added: (processed-flight beluga3)
   goals met: 8 of 10
23. (stack-rack jig0004 jig0002 factory_trailer_1 rack00 fside bside n08 n24 n16)
   deleted: (in jig0004 factory_trailer_1) (clear jig0002 fside) (free-space rack00 n24)
   added: (in jig0004 rack00) (empty factory_trailer_1) (clear jig0004 fside) (next-to jig0004 jig0002 fside) (next-to jig0002 jig0004 bside) (free-space rack00 n16)
   goals met: 8 of 10
24. (pick-up-rack jig0005 factory_trailer_1 rack01 fside bside n11 n13 n24)
   deleted: (in jig0005 rack01) (empty factory_trailer_1) (clear jig0005 bside) (clear jig0005 fside) (free-space rack01 n13)
   added: (in jig0005 factory_trailer_1) (empty rack01) (free-space rack01 n24)
   goals met: 8 of 10
25. (deliver-to-hangar jig0005 dummy-jig factory_trailer_1 hangar1 pl1 n11 n08)
   deleted: (in jig0005 factory_trailer_1) (to_deliver jig0005 pl1) (size jig0005 n11)
   added: (empty factory_trailer_1) (empty jig0005) (in jig0005 hangar1) (to_deliver dummy-jig pl1) (size jig0005 n08)
   goals met: 9 of 10
26. (load-beluga jig0003 typeb typeb beluga3 beluga_trailer_1 slot0 slot1)
   deleted: (in jig0003 beluga_trailer_1) (to_load typeb slot0 beluga3)
   added: (in jig0003 beluga3) (empty beluga_trailer_1) (to_load typeb slot1 beluga3)
   goals met: 9 of 10
27. (unstack-rack jig0002 jig0004 beluga_trailer_1 rack00 bside fside n08 n16 n24)
   deleted: (in jig0002 rack00) (empty beluga_trailer_1) (next-to jig0002 jig0004 bside) (next-to jig0004 jig0002 fside) (free-space rack00 n16)
   added: (in jig0002 beluga_trailer_1) (clear jig0004 bside) (free-space rack00 n24)
   goals met: 9 of 10
28. (load-beluga jig0002 typeb typeb beluga3 beluga_trailer_1 slot1 slot2)
   deleted: (in jig0002 beluga_trailer_1) (to_load typeb slot1 beluga3)
   added: (in jig0002 beluga3) (empty beluga_trailer_1) (to_load typeb slot2 beluga3)
   goals met: 9 of 10
29. (pick-up-rack jig0004 beluga_trailer_1 rack00 bside fside n08 n24 n32)
   deleted: (in jig0004 rack00) (empty beluga_trailer_1) (clear jig0004 bside) (clear jig0004 fside) (free-space rack00 n24)
   added: (in jig0004 beluga_trailer_1) (empty rack00) (free-space rack00 n32)
   goals met: 9 of 10
30. (load-beluga jig0004 typeb dummy-type beluga3 beluga_trailer_1 slot2 dummy-slot)
   deleted: (in jig0004 beluga_trailer_1) (to_load typeb slot2 beluga3)
   added: (in jig0004 beluga3) (empty beluga_trailer_1) (to_load dummy-type dummy-slot beluga3)
   goals met: 10 of 10
